<?php
include("includeSettings.php");			//يحتوي هذه الملف على جميع الإعدادات الخاصه ببوابات الإرسال
$mobile = ""; 							//رقم الجوال (إسم المستخدم) في موبايلي
$password = "";							//كلمة المرور في موبايلي
$activetCode = "";                     	//كود التفعيل الذي تم إستلامه على الجوال
$senderId = "";                         //القيمة العدديه الناتجه من عملية طلب تفعيل رقم الجوال كإسم مرسل، وبدون الرمز (#)، وكمثال فإن الرقم #110 يجب إرساله على الشكل 110
$resultType = 0;						//دالة تحديد نوع النتيجه الراجعه من البوابة
										//0: إرجاع نتيجة البوابة بشكل عددي
										//1: إرجاع نتيجة البوابة بشكل نصي	

// دالة تفعيل رقم الجوال كإسم مرسل
echo activeSender($mobile, $password, $senderId, $activetCode, $resultType);
?>