<?php
include("includeSettings.php");			//يحتوي هذه الملف على جميع الإعدادات الخاصه ببوابات الإرسال
$mobile = ""; 							//رقم الجوال (إسم المستخدم) في موبايلي
$password = "";							//كلمة المرور في موبايلي
$sender = "";		                 	//اسم المرسل الذي تريد تفعيله. يجب أن لا يتجاوز طوله 11 حرف ويتكون من الأحرف بالإنجليزيه (بدون أي رموز خاصه).
$resultType = 0;						//دالة تحديد نوع النتيجه الراجعه من البوابة
										//0: إرجاع نتيجة البوابة بشكل عددي
										//1: إرجاع نتيجة البوابة بشكل نصي	

// دالة تفعيل إسم خاص كإسم مرسل
echo addAlphaSender($mobile, $password, $sender, $resultType);
?>