<?php
include("includeSettings.php");			//يحتوي هذه الملف على جميع الإعدادات الخاصه ببوابات الإرسال
$mobile = ""; 							//رقم الجوال (إسم المستخدم) في موبايلي
$password = "";							//كلمة المرور في موبايلي
$sender = "";							//رقم الجوال الذي تريد تفعيله كإسم مرسل. يجب كتابة الرقم بالصيغة الدولية كالتالي: 966505555555
$resultType = 0;						//دالة تحديد نوع النتيجه الراجعه من البوابة
										//0: إرجاع نتيجة البوابة بشكل عددي
										//1: إرجاع نتيجة البوابة بشكل نصي	

// دالة طلب تفعيل رقم الجوال كإسم مرسل
echo addSender($mobile, $password ,$sender, $resultType);
?>