<?php
include("includeSettings.php");			//يحتوي هذه الملف على جميع الإعدادات الخاصه ببوابات الإرسال
$mobile = ""; 							//رقم الجوال (إسم المستخدم) في موبايلي
$oldPassword = "";						//كلمة المرور القديمه في موبايلي
$newPassword = "";						//كلمة المرور الجديد في موبايلي
$resultType = 0;						//دالة تحديد نوع النتيجه الراجعه من البوابة
										//0: إرجاع نتيجة البوابة بشكل عددي
										//1: إرجاع نتيجة البوابة بشكل نصي										

// دالة تغيير كلمة المرور
echo changePassword($mobile, $oldPassword, $newPassword, $resultType);
?>