<?php
include("includeSettings.php");			//يحتوي هذه الملف على جميع الإعدادات الخاصه ببوابات الإرسال
$mobile = ""; 							//رقم الجوال (إسم المستخدم) في موبايلي
$password = "";							//كلمة المرور في موبايلي
$deleteKey = "";                     	//رقم الإرساليه المراد حذها، وهو نفسه الرقم الذي تم تمرير إلى بوابة الإرسال في القيمة: deleteKey
$resultType = 0;						//دالة تحديد نوع النتيجه الراجعه من البوابة
										//0: إرجاع نتيجة البوابة بشكل عددي
										//1: إرجاع نتيجة البوابة بشكل نصي	

// دالة حذف الرسائل المؤقته قبل إرسالها
echo deleteSMS($mobile, $password, $deleteKey, $resultType);
?>