<?php
include("includeSettings.php");			//يحتوي هذه الملف على جميع الإعدادات الخاصه ببوابات الإرسال
$mobile = ""; 							//رقم الجوال (إسم المستخدم) في موبايلي
$sendtype = 1;							//دالة تحديد مكان إرسال كلمة المرور
										//1: إرسال كلمة المرور على الجوال
										//2: إرسال كلمة المرور على الإيميل، ويجب توفر الإيميل بالشكل الصحيح ضمن المعلومات الشخصيه في الموقع
$resultType = 0;						//دالة تحديد نوع النتيجه الراجعه من البوابة
										//0: إرجاع نتيجة البوابة بشكل عددي
										//1: إرجاع نتيجة البوابة بشكل نصي	

// دالة إسترجاع كلمة المرور
echo forgetPassword($mobile, $sendtype, $resultType);
?>