<?php
include("includeSettings.php");							//يحتوي هذه الملف على جميع الإعدادات الخاصه ببوابات الإرسال
$mobile = "";											//رقم الجوال (إسم المستخدم) في موبايلي
$password = "";											//كلمة المرور في موبايلي

$sender = "NEW SMS";									//اسم المرسل الذي سيظهر عند ارسال الرساله، ويتم تشفيره إلى  بشكل تلقائي إلى نوع التشفير (urlencode)

$numbers = "";											//يجب كتابة الرقم بالصيغة الدولية مثل 96650555555 وعند الإرسال إلى أكثر من رقم يجب وضع الفاصلة (,) وهي التي عند حرف الواو بين كل رقمين 
														//لا يوجد عدد محدد من الأرقام التي يمكنك الإرسال لها في حال تم الإرسال من خلال بوابة fsockpoen  أو بوابة CURL،
														//ولكن في حال تم الإرسال من خلال بوابة fOpen ، فإنه يمكنك الإرسال إلى 120 رقم فقط في كل عملية إرسال
														//ملاحظه هامه: عدد الأرقام يجب أن يساوي عدد الرسائل في msgKey

$msg = "مرحبا بك أخي (1)، تاريخ إشتراكك لغاية (2)";		//القالب العام

$msgKey = "(1),*,محمد,@,(2),*,12/10/2008***(1),*,أحمد,@,(2),*,10/10/2008";	/*  القيم التعويضيه، وفيما يلي تفاصيل الرموز
																				•	(1)، (2)،...: للدلاله على الرموز التي يجب التعويض عنها 
																				•	* تفصل بين الرمز المطلوب إستبداله في الرساله والقيمة المستبدل بها.
																				•	@ تفصل بين تعريف الرمز الأول وقيمته والرمز الثاني وقيمته.
																				•	*** تفصل بين قيم الرساله الأولى وقيم الرساله الثانيه.
																				
																				ملاحظات على عملية الإرسال بإستخدام القوالب
																				sendSMSWK ارسال الرساله بصيغة اليونيكود يتم تحويل الرسالة داخل الفنكشن 
																				
																				كل رساله باللغة العربيه  70 حرف
																				كل رساله باللغة الانجليزيه 160 حرف
																				في حال ارسال اكثر من رساله عربيه فان الرساله الواحده تحسب 67
																				والرساله الانجليزي 158
																				*/

$MsgID = rand(1,99999);					//رقم عشوائي يتم إرفاقه مع الإرساليه، في حال الرغبة بإرسال نفس الإرساليه في أقل من ساعه من إرسال الرساله الأولى.
										//موقع موبايلي يمنع تكرار إرسال نفس الرساله خلال ساعه من إرسالها، إلا في حال تم إرسال قيمة مختلفه مع كل إرساليه.
										
$timeSend = 0;							//لتحديد وقت الإرساليه - 0 تعني الإرسال الآن
										//الشكل القياسي للوقت هو hh:mm:ss

$dateSend = 0;							//لتحديد تاريخ الإرساليه - 0 تعني الإرسال الآن
										//الشكل القياسي للتاريخ هو mm/dd/yyyy
										
$deleteKey = 152485;					//يمكنك من خلال هذه القيمة  القيمه يمكنك من خلالها حذف الرساله من خلال بوابة حذف الرسائل.
										//يمكنك تحديد رقم واحد لمجموعه من الإرساليات، بحيث يتم حذفها دفعه واحده.
										
$resultType = 0;						//دالة تحديد نوع النتيجه الراجعه من البوابة
										//0: إرجاع نتيجة البوابة بشكل عددي
										//1: إرجاع نتيجة البوابة بشكل نصي											

// دالة إرسال رسائل القوالب
echo sendSMSWK($mobile, $password, $numbers, $sender, $msg, $msgKey, $MsgID, $timeSend, $dateSend, $deleteKey, $resultType);
?>